--- tmd_annotations ---
650 train sentences
81 dev sentences
81 test sentences
Pad words to uniform length for characters embeddings
Words padded to 50 characters
2020-03-18 12:25:27.575511: I tensorflow/core/platform/cpu_feature_guard.cc:140] Your CPU supports instructions that this TensorFlow binary was not compiled to use: AVX2 FMA
LSTM-Size: [100, 100]
_____________________________________________________________________________________________________________________________
Layer (type)                             Output Shape               Param #        Connected to
=============================================================================================================================
char_input (InputLayer)                  (None, None, 50)           0
_____________________________________________________________________________________________________________________________
char_emd (TimeDistributed)               (None, None, 50, 30)       2850           char_input[0][0]
_____________________________________________________________________________________________________________________________
words_input (InputLayer)                 (None, None)               0
_____________________________________________________________________________________________________________________________
casing_input (InputLayer)                (None, None)               0
_____________________________________________________________________________________________________________________________
char_cnn (TimeDistributed)               (None, None, 50, 30)       2730           char_emd[0][0]
_____________________________________________________________________________________________________________________________
word_embeddings (Embedding)              (None, None, 100)          6541200        words_input[0][0]
_____________________________________________________________________________________________________________________________
casing_emebddings (Embedding)            (None, None, 10)           80             casing_input[0][0]
_____________________________________________________________________________________________________________________________
char_pooling (TimeDistributed)           (None, None, 30)           0              char_cnn[0][0]
_____________________________________________________________________________________________________________________________
concatenate_1 (Concatenate)              (None, None, 140)          0              word_embeddings[0][0]
                                                                                   casing_emebddings[0][0]
                                                                                   char_pooling[0][0]
_____________________________________________________________________________________________________________________________
shared_varLSTM_1 (Bidirectional)         (None, None, 200)          192800         concatenate_1[0][0]
_____________________________________________________________________________________________________________________________
shared_varLSTM_2 (Bidirectional)         (None, None, 200)          240800         shared_varLSTM_1[0][0]
_____________________________________________________________________________________________________________________________
tmd_annotations_hidden_lin_layer (TimeDi (None, None, 19)           3819           shared_varLSTM_2[0][0]
_____________________________________________________________________________________________________________________________
tmd_annotations_crf (ChainCRF)           (None, None, 19)           399            tmd_annotations_hidden_lin_layer[0][0]
=============================================================================================================================
Total params: 6,984,678
Trainable params: 443,478
Non-trainable params: 6,541,200
_____________________________________________________________________________________________________________________________
